# 1. Сумма трех
# Посчитайте сумму трех введенных целых чисел

# 2. Площадь
# Пользователь вводит стороны прямоугольника, выведите его площадь

# 3. Периметр
# Пользователь вводит стороны прямоугольника, выведите его периметр

first = int(input('Введите первое число '))
second = int(input('Введите второе число '))
third = int(input('Введите третье число '))
print(first + second + third)

a = int(input('Введите сторону прямоугольника '))
b = int(input('Введите сторону прямоугольника '))
print(a * b)

a = int(input('Введите сторону прямоугольника '))
b = int(input('Введите сторону прямоугольника '))
print(2 * (a + b))